In [ ]:
import pandas as pd 
from src.config import PROJ_ROOT
from pathlib import Path
import os

# Check if we're in a notebook
if "__file__" in globals():
    PROJ_ROOT = Path(__file__).resolve().parents[1]
else:
    # Use the current working directory or an environment variable as fallback
    PROJ_ROOT = Path(os.getenv("BHP_PROJ_ROOT", Path.cwd())).resolve()

In [50]:
df = pd.read_csv((PROJ_ROOT / '..' / 'data' / 'interim' / 'tuition.csv').resolve()) 
df

,id,institution,tuition_in,tuition_out,year
0,100654,Alabama A & M University,4664.0,5200.0,2000
1,100663,University of Alabama at Birmingham,3363.0,6183.0,2000
2,100706,University of Alabama in Huntsville,3112.0,6516.0,2000
3,100724,Alabama State University,2520.0,5040.0,2000
4,100751,The University of Alabama,3014.0,8162.0,2000
...,...,...,...,...,...
91867,48511109,Georgia Military College - Madison,6638.0,6638.0,2022
91868,48511110,Georgia Military College - Stone Mountain,6638.0,6638.0,2022
91869,48511111,Georgia Military College - Fayetteville,6638.0,6638.0,2022
91870,48511112,Georgia Military College - Dublin,6638.0,6638.0,2022
91871,49005401,HCI College - Fort Lauderdale Campus,18558.0,18558.0,2022

In [30]:
df.query('institution == "Cortiva Institute"')

              institution  tuition_in  tuition_out  year
857     Cortiva Institute         NaN          NaN  1996
1027    Cortiva Institute         NaN          NaN  1996
6338    Cortiva Institute         NaN          NaN  1996
7813    Cortiva Institute         NaN          NaN  1997
7970    Cortiva Institute         NaN          NaN  1997
...                   ...         ...          ...   ...
183897  Cortiva Institute         NaN          NaN  2022
186072  Cortiva Institute         NaN          NaN  2022
187180  Cortiva Institute         NaN          NaN  2022
187478  Cortiva Institute         NaN          NaN  2022
187524  Cortiva Institute         NaN          NaN  2022

[148 rows x 4 columns]

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 189734 entries, 0 to 189733
Data columns (total 4 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   institution  189734 non-null  object
 1   tuition_in   94425 non-null   float64
 2   tuition_out  91876 non-null   float64
 3   year         189734 non-null  int64
dtypes: float64(2), int64(1), object(1)
memory usage: 5.8+ MB

In [34]:
df.dropna(inplace=True)
df.institution.value_counts()

institution
Stevens-Henager College                87
Bryan University                       80
Bethel University                      69
Columbia College                       68
Lincoln University                     66
                                       ..
Brown Mackie College-San Diego          1
Brown Mackie College-Denver             1
Brown Mackie College-Orange County      1
Laurel Campus South                     1
SAE Institute of Technology-Chicago     1
Name: count, Length: 6102, dtype: int64

In [36]:
df.query('institution == "Stevens-Henager College"')

                    institution  tuition_in  tuition_out  year
31772   Stevens-Henager College     12075.0      12075.0  2000
38388   Stevens-Henager College     12075.0      12075.0  2001
40447   Stevens-Henager College     12000.0      12000.0  2001
46993   Stevens-Henager College     12200.0      12200.0  2002
53526   Stevens-Henager College     13975.0      13975.0  2003
...                         ...         ...          ...   ...
168717  Stevens-Henager College     14585.0      14585.0  2019
168803  Stevens-Henager College     14585.0      14585.0  2019
173361  Stevens-Henager College     16600.0      16600.0  2020
174409  Stevens-Henager College     16600.0      16600.0  2020
175184  Stevens-Henager College     16600.0      16600.0  2020

[87 rows x 4 columns]